//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1987-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	CPU.uni
//
// Description:	CPU unicode description.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string STR_CPU_SKT_C3_STRING                   #language eng "CPU C3 state"
#string STR_CPU_SKT_C3_HELP                     #language eng "CPU C3 power state."
#string STR_CPU_SKT0_C3_VALUE                   #language eng "Not Supported"

#string STR_CPU_SKT_C6_STRING                   #language eng "CPU C6 state"
#string STR_CPU_SKT_C6_HELP                     #language eng "CPU C6 power state."
#string STR_CPU_SKT0_C6_VALUE                   #language eng "Not Supported"

#string STR_CPU_SKT_C7_STRING                   #language eng "CPU C7 state"
#string STR_CPU_SKT_C7_HELP                     #language eng "CPU C7 power state."
#string STR_CPU_SKT0_C7_VALUE                   #language eng "Not Supported"

#string STR_CPU_MAX_RATIO               #language eng "Max Freq Ratio"
#string STR_CPU_MAX_RATIO_HELP          #language eng ""

#string STR_CPU_SET_BOOT_RATIO          #language eng "Set Boot Freq Ratio"
#string STR_CPU_SET_BOOT_RATIO_HELP     #language eng ""

#string STR_CPU_SKT_EIST_STRING                 #language eng "EIST Technology"
#string STR_CPU_SKT_EIST_HELP                   #language eng "Enhanced Intel SpeedStep Technology"
#string STR_CPU_SKT0_EIST_VALUE                 #language eng "Not Supported"

#string STR_CPU_POWER_LIMIT_LOCK                    #language eng "    Package power limit lock"
#string STR_CPU_POWER_LIMIT_LOCK_HELP               #language eng "When enabled, PACKAGE_POWER_LIMIT MSR will be locked and a reset will be required to unlock the register."

#string STR_CPU_LONG_DUR_PWR                    #language eng "    Cpu Power Limit1"
#string STR_CPU_LONG_DUR_PWR_HELP               #language eng "Cpu Power Limit1 value"

#string STR_CPU_LONG_DUR_TIME                   #language eng "    Cpu Power Limit1 Time"
#string STR_CPU_LONG_DUR_TIME_HELP              #language eng "Time window which the Power Limit1 is maintained."

#string STR_CPU_SHRT_DUR_PWR                    #language eng "    Cpu Power Limit2"
#string STR_CPU_SHRT_DUR_PWR_HELP               #language eng "Cpu Power Limit2 value"

#string STR_CPU_PLATFORM_POWER_LIMIT_LOCK       #language eng "    Platform power limit lock"
#string STR_CPU_PLATFORM_POWER_LIMIT_LOCK_HELP  #language eng "When enabled, PLATFORM_POWER_LIMIT MSR will be locked and a reset will be required to unlock the register."

#string STR_CPU_POWER_LIMIT3                    #language eng "    Cpu Power Limit3"
#string STR_CPU_POWER_LIMIT3_HELP               #language eng "Cpu Power Limit3 value"

#string STR_CPU_PL3_TIME                    	#language eng "    Cpu Power Limit3 Time"
#string STR_CPU_PL3_TIME_HELP               	#language eng "Time window which the Power Limit3 is maintained."

#string STR_CPU_PL3_DUTY_CYCLE              	#language eng "    Cpu Power Limit3 Duty Cycle"
#string STR_CPU_PL3_DUTY_CYCLE_HELP         	#language eng "Specify the duty cycle in percentage that the CPU is required to maintain over the configured Power Limit3 time windows."

#string STR_DDR_PWR_LIMIT1                      #language eng "    DDR Power Limit1"
#string STR_DDR_PWR_LIMIT1_HELP                 #language eng "DDR Power Limit1 value"

#string STR_DDR_PWR_LIMIT1_TIME                 #language eng "    DDR Power Limit1 Time"
#string STR_DDR_PWR_LIMIT1_TIME_HELP            #language eng "Time window which the DDR Power Limit1 is maintained."

#string STR_DDR_PWR_LIMIT2                      #language eng "    DDR Power Limit2"
#string STR_DDR_PWR_LIMIT2_HELP                 #language eng "DDR Power Limit2 value"

#string STR_CPU_1_CORE_RATIO_LIMIT              #language eng "    1-Core Ratio Limit"
#string STR_CPU_1_CORE_RATIO_LIMIT_HELP         #language eng "This limit is for 1 core active. 0 means using the factory-configured value."

#string STR_CPU_2_CORE_RATIO_LIMIT              #language eng "    2-Core Ratio Limit"
#string STR_CPU_2_CORE_RATIO_LIMIT_HELP         #language eng "This limit is for 2 cores active. 0 means using the factory-configured value."

#string STR_CPU_3_CORE_RATIO_LIMIT              #language eng "    3-Core Ratio Limit"
#string STR_CPU_3_CORE_RATIO_LIMIT_HELP         #language eng "This limit is for 3 cores active.  0 means using the factory-configured value."

#string STR_CPU_4_CORE_RATIO_LIMIT              #language eng "    4-Core Ratio Limit"
#string STR_CPU_4_CORE_RATIO_LIMIT_HELP         #language eng "This limit is for 4 cores active.  0 means using the factory-configured value."

#string STR_CPU_5_CORE_RATIO_LIMIT              #language eng "    5-Core Ratio Limit"
#string STR_CPU_5_CORE_RATIO_LIMIT_HELP         #language eng "This limit is for 5 cores active.  0 means using the factory-configured value."

#string STR_CPU_6_CORE_RATIO_LIMIT              #language eng "    6-Core Ratio Limit"
#string STR_CPU_6_CORE_RATIO_LIMIT_HELP         #language eng "This limit is for 6 cores active.  0 means using the factory-configured value."

#string STR_CPU_7_CORE_RATIO_LIMIT              #language eng "    7-Core Ratio Limit"
#string STR_CPU_7_CORE_RATIO_LIMIT_HELP         #language eng "This limit is for 7 cores active.  0 means using the factory-configured value."

#string STR_CPU_8_CORE_RATIO_LIMIT              #language eng "    8-Core Ratio Limit"
#string STR_CPU_8_CORE_RATIO_LIMIT_HELP         #language eng "This limit is for 8 cores active.  0 means using the factory-configured value."

#string STR_CPU_LONG_LATENCY                    #language eng "Long"
#string STR_CPU_SHORT_LATENCY                   #language eng "Short"

#string STR_CPU_BASE_FREQ_STRING        #language eng "Base Frequency"
#string STR_CPU_BASE_FREQ_HELP          #language eng "Base Frequency"
#string STR_CPU_CPU_BASE_FREQ_VALUE     #language eng "100 MHz"
//#string STR_XE_CORE_RATIO_LIMIT         #language eng "XE Core Ratio Limit"
//#string STR_XE_CORE_RATIO_LIMIT_HELP    #language eng "XE Core Ratio Limit. CPU Frequency is Base Frequency * Ratio. 0 means using the factory-configured value."

#string STR_PRIMARY_PLANE_CURRENT_LOCK      #language eng "VR Current value lock"
#string STR_PRIMARY_PLANE_CURRENT_LOCK_HELP #language eng "Locks VR Current value from further writes until a reset."
#string STR_PRIMARY_PLANE_CURRENT       	#language eng "VR Current value"
#string STR_PRIMARY_PLANE_CURRENT_HELP  	#language eng "Voltage Regulator Current Limit.0 means AUTO."

#string STR_SECONDARY_PLANE_CURRENT       #language eng "Secondary Plane Current value"
#string STR_SECONDARY_PLANE_CURRENT_HELP  #language eng "The Maximum instantaneous current allow for Secondary Plane"

#string STR_CPU_TCC_ACTIVATION_OFFSET          #language eng "TCC Activation Offset"
#string STR_CPU_TCC_ACTIVATION_OFFSET_HELP     #language eng "Offset from the factory TCC activation temperature" 

//#string STR_CPU_FACTY_VID_HELP          #language eng "Factory VID for Max Turbo Ratio"
//#string STR_CPU_FACTY_VID_STRING        #language eng "Factory VID for Max Turbo Ratio"
//#string STR_CPU_FACTY_VID_VALUE         #language eng ""

//#string STR_CPU_VID                     #language eng "VID Override for Max Turbo Ratio"
//#string STR_CPU_VID_HELP                #language eng "VID Override for Max Turbo Ratio in 1/256 Volts"

//#string STR_CPU_PM_PROMPT		#language eng "Power Technology"
//#string STR_CPU_PM_PROMPT_HELP	#language eng "Enable the power management features."
//#string STR_CPU_PM_DISABLED		#language eng "Disable"
//#string STR_CPU_PM_ENABLED		#language eng "Energy Efficient"
//#string STR_CPU_PM_CUSTOM		#language eng "Custom"

#string STR_CPU_ACPI_C2         #language eng "ACPI C-2"
#string STR_CPU_ACPI_C3         #language eng "ACPI C-3"

#string STR_CPU_EIST_PROMPT			#language eng "EIST"
#string STR_CPU_EIST_PROMPT_HELP	#language eng "Enable/Disable Intel SpeedStep"

#string STR_CPU_TURBO_MODE_PROMPT               #language eng "Turbo Mode"
#string STR_CPU_TURBO_MODE_PROMPT_HELP          #language eng "Turbo Mode." 

#string STR_CPU_PACKAGE_CSTATE_REPORT_LOCK       #language eng "CFG lock"
#string STR_CPU_PACKAGE_CSTATE_REPORT_LOCK_HELP  #language eng "Configure MSR 0xE2[15], CFG lock bit."

#string STR_CPU_PACKAGE_CSTATE_REPORT       #language eng "Package C State limit"
#string STR_CPU_PACKAGE_CSTATE_REPORT_HELP  #language eng "Package C State limit"

#string STR_CPU_C0SUPPORT                   #language eng "C0/C1"
//#string STR_CPU_C1SUPPORT                   #language eng "C1"
#string STR_CPU_C2SUPPORT                   #language eng "C2"
#string STR_CPU_C3SUPPORT                   #language eng "C3"
#string STR_CPU_C6SUPPORT                   #language eng "C6"
#string STR_CPU_C7SUPPORT                   #language eng "C7"
#string STR_CPU_C7SSUPPORT                   #language eng "C7s"
#string STR_CPU_C8SUPPORT                   #language eng "C8"
#string STR_CPU_C9SUPPORT                   #language eng "C9"
#string STR_CPU_C10SUPPORT                   #language eng "C10"
#string STR_CPU_AUTO                        #language eng "AUTO"

//#string STR_CPU_NOLIMIT                     #language eng "No Limit"
//#string STR_CPU_NOLIMIT_HELP                #language eng "No Package C State limit"

//#string STR_CPU_DEFAULT                     #language eng "Default"
//#string STR_CPU_DEFAULT_HELP                #language eng "Use factory-configured value"

#string STR_CPU_CTATES_PROMPT                   #language eng "CPU C states"
#string STR_CPU_CTATES_PROMPT_HELP              #language eng "Enable or disable CPU C states"

#string STR_CPU_C1E_PROMPT                      #language eng "  Enhanced C1 state"
#string STR_CPU_C1E_PROMPT_HELP                 #language eng "Enhanced C1 state"

#string STR_CPU_C3_PROMPT		                #language eng "  CPU C3 Report"
#string STR_CPU_C3_PROMPT_HELP		            #language eng "Enable/Disable CPU C3 report to OS"

#string STR_CPU_C6_PROMPT                     #language eng "  CPU C6 report"
#string STR_CPU_C6_PROMPT_HELP                #language eng "Enable/Disable CPU C6 report to OS"

#string STR_CPU_C6_LATENCY_PROMPT               #language eng "    C6 Latency"
#string STR_CPU_C6_LATENCY_PROMPT_HELP          #language eng "Configure Short/Long latency for C6"

#string STR_CPU_C7_PROMPT                     #language eng "  CPU C7 report"
#string STR_CPU_C7_PROMPT_HELP                #language eng "Enable/Disable CPU C7 report to OS"
#string STR_CPU_C7                            #language eng "CPU C7"
#string STR_CPU_C7S                           #language eng "CPU C7s"

#string STR_CPU_C8_PROMPT                     #language eng "  CPU C8 report"
#string STR_CPU_C8_PROMPT_HELP                #language eng "Enable/Disable CPU C8 report to OS"

#string STR_CPU_C9_PROMPT                     #language eng "  CPU C9 report"
#string STR_CPU_C9_PROMPT_HELP                #language eng "Enable/Disable CPU C9 report to OS"

#string STR_CPU_C10_PROMPT                     #language eng "  CPU C10 report"
#string STR_CPU_C10_PROMPT_HELP                #language eng "Enable/Disable CPU C10 report to OS"

#string STR_CPU_C7_LATENCY_PROMPT               #language eng "    C7 Latency"
#string STR_CPU_C7_LATENCY_PROMPT_HELP          #language eng "Configure Short/Long latency for C7"

#string STR_CPU_CX_PREWAKE_PROMPT               #language eng "  C state Pre-Wake"
#string STR_CPU_CX_PREWAKE_PROMPT_HELP          #language eng "Enable or disable C state Pre-Wake feature"

#string STR_CPU_C1DEMOTION_PROMPT               #language eng "  C1 state auto demotion"
#string STR_CPU_C1DEMOTION_PROMPT_HELP          #language eng "Processor will conditionally demote C3/C6/C7 requests to C1 based on uncore auto-demote information"

#string STR_CPU_C3DEMOTION_PROMPT               #language eng "  C3 state auto demotion"
#string STR_CPU_C3DEMOTION_PROMPT_HELP          #language eng "Processor will conditionally demote C6/C7 requests to C3 based on uncore auto-demote information"

#string STR_CPU_C1UNDEMOTION_PROMPT             #language eng "  C1 state auto undemotion"
#string STR_CPU_C1UNDEMOTION_PROMPT_HELP        #language eng "Un-demotion from Demoted C1."

#string STR_CPU_C3UNDEMOTION_PROMPT             #language eng "  C3 state auto undemotion"
#string STR_CPU_C3UNDEMOTION_PROMPT_HELP        #language eng "Un-demotion from Demoted C3."

#string STR_CPU_PACKAGECDEMOTION_PROMPT         #language eng "  Package C state demotion"
#string STR_CPU_PACKAGECDEMOTION_PROMPT_HELP    #language eng "Enable Package C state demotion."

#string STR_CPU_PACKAGECUNDEMOTION_PROMPT		#language eng "  Package C state undemotion"
#string STR_CPU_PACKAGECUNDEMOTION_PROMPT_HELP  #language eng "Enable Package C state undemotion"

#string STR_CPU_C3_LATENCY_CONTROL_TIME_UNIT    	#language eng "  C3 latency time unit"
#string STR_CPU_C3_LATENCY_CONTROL_TIME_UNIT_HELP	#language eng "Control the unit of measurement for the Interrupt Response Time Limit specified in MSR 0x60A[9:0]."

#string STR_CPU_C3_LATENCY_CONTROL_LATENCY		    #language eng "  C3 latency"
#string STR_CPU_C3_LATENCY_CONTROL_LATENCY_HELP		#language eng "Specifies the interrupt response time limit that should be used to decide if the package should be put into a Package C3 state."

#string STR_CPU_C6C7_SHORT_LATENCY_CONTROL_TIME_UNIT    	#language eng "  C6/C7 short latency time unit"
#string STR_CPU_C6C7_SHORT_LATENCY_CONTROL_TIME_UNIT_HELP	#language eng "Control the unit of measurement for the Interrupt Response Time Limit specified in MSR 0x60B[9:0]."

#string STR_CPU_C6C7_SHORT_LATENCY_CONTROL_LATENCY		    #language eng "  C6/C7 short latency"
#string STR_CPU_C6C7_SHORT_LATENCY_CONTROL_LATENCY_HELP		#language eng "Specifies the interrupt response time limit that should be used to decide if the package should be put into a Package C6/C7 state."

#string STR_CPU_C6C7_LONG_LATENCY_CONTROL_TIME_UNIT  	  	#language eng "  C6/C7 long latency time unit"
#string STR_CPU_C6C7_LONG_LATENCY_CONTROL_TIME_UNIT_HELP	#language eng "Control the unit of measurement for the Interrupt Response Time Limit specified in MSR 0x60C[9:0]."

#string STR_CPU_C6C7_LONG_LATENCY_CONTROL_LATENCY		    #language eng "  C6/C7 long latency"
#string STR_CPU_C6C7_LONG_LATENCY_CONTROL_LATENCY_HELP		#language eng "Specifies the interrupt response time limit that should be used to decide if the package should be put into a Package C6/C7 state."

#string STR_CPU_LATENCY_CONTROL_TIME_UNIT_1NS   		#language eng "1 ns"
#string STR_CPU_LATENCY_CONTROL_TIME_UNIT_32NS   		#language eng "32 ns"
#string STR_CPU_LATENCY_CONTROL_TIME_UNIT_1024NS   		#language eng "1024 ns"
#string STR_CPU_LATENCY_CONTROL_TIME_UNIT_32768NS   	#language eng "32768 ns"
#string STR_CPU_LATENCY_CONTROL_TIME_UNIT_1048576NS   	#language eng "1048576 ns"
#string STR_CPU_LATENCY_CONTROL_TIME_UNIT_33554432NS   	#language eng "33554432 ns"

#string STR_CPU_AES_PROMPT                     #language eng "CPU AES"
#string STR_CPU_AES_PROMPT_HELP                #language eng "Enable/Disable CPU Advanced Encryption Standard instructions"

#string STR_CPUTDP_LEVEL_PROMPT                #language eng "Configurable TDP Level"
#string STR_CPUTDP_LEVEL_PROMPT_HELP           #language eng "Allow reconfiguration of TDP levels base on current power and thermal delivery capabilities of the system."
#string STR_CPUTDP_LEVEL_NOMINAL               #language eng "TDP NOMINAL"
#string STR_CPUTDP_LEVEL_UP                    #language eng "TDP UP"
#string STR_CPUTDP_LEVEL_DOWN                  #language eng "TDP DOWN"

#string STR_CPU_CTDP_BIOS_PROMPT               #language eng "ACPI CTDP BIOS"
#string STR_CPU_CTDP_BIOS_PROMPT_HELP          #language eng "Enable/Disable ACPI CTDP BIOS supoort "

#string STR_CPUTDP_LOCK_PROMPT                 #language eng "Config TDP LOCK"
#string STR_CPUTDP_LOCK_PROMPT_HELP           #language eng "Lock the Config TDP Control register"

#string STR_CPU_TSTATE_PROMPT                 #language eng "ACPI T State"
#string STR_CPU_TSTATE_PROMPT_HELP            #language eng "Enable/Disable ACPI T state support"

//#string STR_CPU_CX_INTR_FILTER_PROMPT       #language eng "Interrupt Filtering"
//#string STR_CPU_CX_INTR_FILTER_PROMPT_HELP  #language eng "When enabled, only the core that is the destination of an interrupt while in C3/C6 will be notified to transition to C0. When disabled, all cores be notified to transition to C0, regardless of destination."

#string STR_CPU_LAKETINY_PROMPT                #language eng "LakeTiny Feature"
#string STR_CPU_LAKETINY_PROMPT_HELP           #language eng "Enable/Disable LakeTiny for C state configuration"

#string STR_CPU_IOUT_OFFSET_PROMPT             #language eng "IOUT OFFSET"
#string STR_CPU_IOUT_OFFSET_PROMPT_HELP        #language eng "VR IOUT OFFSET configuration, range 0 ~ 625"

#string STR_CPU_IOUT_SLOPE_PROMPT              #language eng "IOUT SLOPE"
#string STR_CPU_IOUT_SLOPE_PROMPT_HELP         #language eng "VR IOUT SLOPE configuration, range 0 ~ 1023"

#string STR_CPU_IOUT_OFFSET_SIGN_PROMPT        #language eng "IOUT OFFSET Sign"
#string STR_CPU_IOUT_OFFSET_SIGN_PROMPT_HELP   #language eng "0 positive offset. 1 negative offset."

#string STR_CPU_ENG_PERF_BIAS_PROMPT        #language eng "Energy Performance"
#string STR_CPU_ENG_PERF_BIAS_PROMPT_HELP   #language eng "Optimize between performance and power savings."
#string STR_CPU_ENG_PERF_BIAS_PERFORM       #language eng "Performance"
#string STR_CPU_ENG_PERF_BIAS_BAL_PERFORM   #language eng "Balanced Performance"
#string STR_CPU_ENG_PERF_BIAS_BAL_ENRGY     #language eng "Balanced Energy"
#string STR_CPU_ENG_PERF_BIAS_ERGY_EFFIC    #language eng "Energy Efficient"

#string STR_CPU_OVERCLOCKING_LOCK              #language eng "Overclocking lock"
#string STR_CPU_OVERCLOCKING_LOCK_HELP         #language eng "FLEX_RATIO(194) MSR"

#string STR_CPU_BOOT_PERFORMANCE_PROMPT	        #language eng "Boot performance mode"
#string STR_CPU_BOOT_PERFORMANCE_PROMPT_HELP   	#language eng "Select the performance state that the BIOS will set before OS handoff."
#string STR_CPU_BOOT_PERFORMANCE_MAX_NONTURBO	#language eng "Max Non-Turbo Performance"
#string STR_CPU_BOOT_PERFORMANCE_MAX_BATTERY	#language eng "Max Battery"
#string STR_CPU_BOOT_PERFORMANCE_TURBO	        #language eng "Turbo Performance"

//#string <string name> #language eng ""

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1987-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
